MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx675f512l.h
extern volatile __DCH6DSAbits_t DCH6DSAbits __asm__ ("DCH6DSA") __attribute__((section("sfrs"), address(0xBF883520)));
extern volatile uint32_t        DCH6DSACLR __attribute__((section("sfrs"),address(0xBF883524)));
extern volatile uint32_t        DCH6DSASET __attribute__((section("sfrs"),address(0xBF883528)));
extern volatile uint32_t        DCH6DSAINV __attribute__((section("sfrs"),address(0xBF88352C)));
#define DCH6SSIZ DCH6SSIZ
extern volatile uint32_t   DCH6SSIZ __attribute__((section("sfrs"), address(0xBF883530)));
extern volatile uint32_t        DCH6SSIZCLR __attribute__((section("sfrs"),address(0xBF883534)));
extern volatile uint32_t        DCH6SSIZSET __attribute__((section("sfrs"),address(0xBF883538)));
extern volatile uint32_t        DCH6SSIZINV __attribute__((section("sfrs"),address(0xBF88353C)));
#define DCH6DSIZ DCH6DSIZ
extern volatile uint32_t   DCH6DSIZ __attribute__((section("sfrs"), address(0xBF883540)));
extern volatile uint32_t        DCH6DSIZCLR __attribute__((section("sfrs"),address(0xBF883544)));
extern volatile uint32_t        DCH6DSIZSET __attribute__((section("sfrs"),address(0xBF883548)));
extern volatile uint32_t        DCH6DSIZINV __attribute__((section("sfrs"),address(0xBF88354C)));
#define DCH6SPTR DCH6SPTR
extern volatile uint32_t   DCH6SPTR __attribute__((section("sfrs"), address(0xBF883550)));
extern volatile uint32_t        DCH6SPTRCLR __attribute__((section("sfrs"),address(0xBF883554)));
extern volatile uint32_t        DCH6SPTRSET __attribute__((section("sfrs"),address(0xBF883558)));
extern volatile uint32_t        DCH6SPTRINV __attribute__((section("sfrs"),address(0xBF88355C)));
#define DCH6DPTR DCH6DPTR
extern volatile uint32_t   DCH6DPTR __attribute__((section("sfrs"), address(0xBF883560)));
extern volatile uint32_t        DCH6DPTRCLR __attribute__((section("sfrs"),address(0xBF883564)));
extern volatile uint32_t        DCH6DPTRSET __attribute__((section("sfrs"),address(0xBF883568)));
extern volatile uint32_t        DCH6DPTRINV __attribute__((section("sfrs"),address(0xBF88356C)));
#define DCH6CSIZ DCH6CSIZ
extern volatile uint32_t   DCH6CSIZ __attribute__((section("sfrs"), address(0xBF883570)));
extern volatile uint32_t        DCH6CSIZCLR __attribute__((section("sfrs"),address(0xBF883574)));
extern volatile uint32_t        DCH6CSIZSET __attribute__((section("sfrs"),address(0xBF883578)));
extern volatile uint32_t        DCH6CSIZINV __attribute__((section("sfrs"),address(0xBF88357C)));
#define DCH6CPTR DCH6CPTR
extern volatile uint32_t   DCH6CPTR __attribute__((section("sfrs"), address(0xBF883580)));
extern volatile uint32_t        DCH6CPTRCLR __attribute__((section("sfrs"),address(0xBF883584)));
extern volatile uint32_t        DCH6CPTRSET __attribute__((section("sfrs"),address(0xBF883588)));
extern volatile uint32_t        DCH6CPTRINV __attribute__((section("sfrs"),address(0xBF88358C)));
#define DCH6DAT DCH6DAT
extern volatile uint32_t   DCH6DAT __attribute__((section("sfrs"), address(0xBF883590)));
extern volatile uint32_t        DCH6DATCLR __attribute__((section("sfrs"),address(0xBF883594)));
extern volatile uint32_t        DCH6DATSET __attribute__((section("sfrs"),address(0xBF883598)));
extern volatile uint32_t        DCH6DATINV __attribute__((section("sfrs"),address(0xBF88359C)));
#define DCH7CON DCH7CON
extern volatile uint32_t   DCH7CON __attribute__((section("sfrs"), address(0xBF8835A0)));
typedef union {
  struct {
    uint32_t CHPRI:2;
    uint32_t CHEDET:1;
    uint32_t :1;
    uint32_t CHAEN:1;
    uint32_t CHCHN:1;
    uint32_t CHAED:1;
    uint32_t CHEN:1;
    uint32_t CHCHNS:1;
    uint32_t :6;
    uint32_t CHBUSY:1;
  };
  struct {
    uint32_t w:32;
  };
} __DCH7CONbits_t;
extern volatile __DCH7CONbits_t DCH7CONbits __asm__ ("DCH7CON") __attribute__((section("sfrs"), address(0xBF8835A0)));
extern volatile uint32_t        DCH7CONCLR __attribute__((section("sfrs"),address(0xBF8835A4)));
extern volatile uint32_t        DCH7CONSET __attribute__((section("sfrs"),address(0xBF8835A8)));
extern volatile uint32_t        DCH7CONINV __attribute__((section("sfrs"),address(0xBF8835AC)));
#define DCH7ECON DCH7ECON
extern volatile uint32_t   DCH7ECON __attribute__((section("sfrs"), address(0xBF8835B0)));
typedef union {
  struct {
    uint32_t :3;
    uint32_t AIRQEN:1;
    uint32_t SIRQEN:1;
    uint32_t PATEN:1;
    uint32_t CABORT:1;
    uint32_t CFORCE:1;
    uint32_t CHSIRQ:8;
    uint32_t CHAIRQ:8;
  };
  struct {
    uint32_t w:32;
  };
} __DCH7ECONbits_t;
extern volatile __DCH7ECONbits_t DCH7ECONbits __asm__ ("DCH7ECON") __attribute__((section("sfrs"), address(0xBF8835B0)));
extern volatile uint32_t        DCH7ECONCLR __attribute__((section("sfrs"),address(0xBF8835B4)));
extern volatile uint32_t        DCH7ECONSET __attribute__((section("sfrs"),address(0xBF8835B8)));
extern volatile uint32_t        DCH7ECONINV __attribute__((section("sfrs"),address(0xBF8835BC)));
#define DCH7INT DCH7INT
extern volatile uint32_t   DCH7INT __attribute__((section("sfrs"), address(0xBF8835C0)));
typedef union {
  struct {
    uint32_t CHERIF:1;
    uint32_t CHTAIF:1;
    uint32_t CHCCIF:1;
    uint32_t CHBCIF:1;
    uint32_t CHDHIF:1;
    uint32_t CHDDIF:1;
    uint32_t CHSHIF:1;
    uint32_t CHSDIF:1;
    uint32_t :8;
    uint32_t CHERIE:1;
    uint32_t CHTAIE:1;
    uint32_t CHCCIE:1;
    uint32_t CHBCIE:1;
    uint32_t CHDHIE:1;
    uint32_t CHDDIE:1;
    uint32_t CHSHIE:1;
    uint32_t CHSDIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __DCH7INTbits_t;
extern volatile __DCH7INTbits_t DCH7INTbits __asm__ ("DCH7INT") __attribute__((section("sfrs"), address(0xBF8835C0)));
extern volatile uint32_t        DCH7INTCLR __attribute__((section("sfrs"),address(0xBF8835C4)));
extern volatile uint32_t        DCH7INTSET __attribute__((section("sfrs"),address(0xBF8835C8)));
extern volatile uint32_t        DCH7INTINV __attribute__((section("sfrs"),address(0xBF8835CC)));
#define DCH7SSA DCH7SSA
extern volatile uint32_t   DCH7SSA __attribute__((section("sfrs"), address(0xBF8835D0)));
typedef struct {
  uint32_t CHSSA:32;
} __DCH7SSAbits_t;
extern volatile __DCH7SSAbits_t DCH7SSAbits __asm__ ("DCH7SSA") __attribute__((section("sfrs"), address(0xBF8835D0)));
extern volatile uint32_t        DCH7SSACLR __attribute__((section("sfrs"),address(0xBF8835D4)));
extern volatile uint32_t        DCH7SSASET __attribute__((section("sfrs"),address(0xBF8835D8)));
extern volatile uint32_t        DCH7SSAINV __attribute__((section("sfrs"),address(0xBF8835DC)));
#define DCH7DSA DCH7DSA
extern volatile uint32_t   DCH7DSA __attribute__((section("sfrs"), address(0xBF8835E0)));
typedef struct {
  uint32_t CHDSA:32;
} __DCH7DSAbits_t;
extern volatile __DCH7DSAbits_t DCH7DSAbits __asm__ ("DCH7DSA") __attribute__((section("sfrs"), address(0xBF8835E0)));
extern volatile uint32_t        DCH7DSACLR __attribute__((section("sfrs"),address(0xBF8835E4)));
extern volatile uint32_t        DCH7DSASET __attribute__((section("sfrs"),address(0xBF8835E8)));
extern volatile uint32_t        DCH7DSAINV __attribute__((section("sfrs"),address(0xBF8835EC)));
#define DCH7SSIZ DCH7SSIZ
extern volatile uint32_t   DCH7SSIZ __attribute__((section("sfrs"), address(0xBF8835F0)));
extern volatile uint32_t        DCH7SSIZCLR __attribute__((section("sfrs"),address(0xBF8835F4)));
extern volatile uint32_t        DCH7SSIZSET __attribute__((section("sfrs"),address(0xBF8835F8)));
extern volatile uint32_t        DCH7SSIZINV __attribute__((section("sfrs"),address(0xBF8835FC)));
#define DCH7DSIZ DCH7DSIZ
extern volatile uint32_t   DCH7DSIZ __attribute__((section("sfrs"), address(0xBF883600)));
extern volatile uint32_t        DCH7DSIZCLR __attribute__((section("sfrs"),address(0xBF883604)));
extern volatile uint32_t        DCH7DSIZSET __attribute__((section("sfrs"),address(0xBF883608)));
extern volatile uint32_t        DCH7DSIZINV __attribute__((section("sfrs"),address(0xBF88360C)));
#define DCH7SPTR DCH7SPTR
extern volatile uint32_t   DCH7SPTR __attribute__((section("sfrs"), address(0xBF883610)));
extern volatile uint32_t        DCH7SPTRCLR __attribute__((section("sfrs"),address(0xBF883614)));
extern volatile uint32_t        DCH7SPTRSET __attribute__((section("sfrs"),address(0xBF883618)));
extern volatile uint32_t        DCH7SPTRINV __attribute__((section("sfrs"),address(0xBF88361C)));
#define DCH7DPTR DCH7DPTR
extern volatile uint32_t   DCH7DPTR __attribute__((section("sfrs"), address(0xBF883620)));
extern volatile uint32_t        DCH7DPTRCLR __attribute__((section("sfrs"),address(0xBF883624)));
extern volatile uint32_t        DCH7DPTRSET __attribute__((section("sfrs"),address(0xBF883628)));
extern volatile uint32_t        DCH7DPTRINV __attribute__((section("sfrs"),address(0xBF88362C)));
#define DCH7CSIZ DCH7CSIZ
extern volatile uint32_t   DCH7CSIZ __attribute__((section("sfrs"), address(0xBF883630)));
extern volatile uint32_t        DCH7CSIZCLR __attribute__((section("sfrs"),address(0xBF883634)));
extern volatile uint32_t        DCH7CSIZSET __attribute__((section("sfrs"),address(0xBF883638)));
extern volatile uint32_t        DCH7CSIZINV __attribute__((section("sfrs"),address(0xBF88363C)));
#define DCH7CPTR DCH7CPTR
extern volatile uint32_t   DCH7CPTR __attribute__((section("sfrs"), address(0xBF883640)));
extern volatile uint32_t        DCH7CPTRCLR __attribute__((section("sfrs"),address(0xBF883644)));
extern volatile uint32_t        DCH7CPTRSET __attribute__((section("sfrs"),address(0xBF883648)));
extern volatile uint32_t        DCH7CPTRINV __attribute__((section("sfrs"),address(0xBF88364C)));
#define DCH7DAT DCH7DAT
extern volatile uint32_t   DCH7DAT __attribute__((section("sfrs"), address(0xBF883650)));
extern volatile uint32_t        DCH7DATCLR __attribute__((section("sfrs"),address(0xBF883654)));
extern volatile uint32_t        DCH7DATSET __attribute__((section("sfrs"),address(0xBF883658)));
extern volatile uint32_t        DCH7DATINV __attribute__((section("sfrs"),address(0xBF88365C)));
#define CHECON CHECON
extern volatile uint32_t   CHECON __attribute__((section("sfrs"), address(0xBF884000)));
typedef union {
  struct {
    uint32_t PFMWS:3;
    uint32_t :1;
    uint32_t PREFEN:2;
    uint32_t :2;
    uint32_t DCSZ:2;
    uint32_t :6;
    uint32_t CHECOH:1;
  };
  struct {
    uint32_t w:32;
  };
} __CHECONbits_t;
extern volatile __CHECONbits_t CHECONbits __asm__ ("CHECON") __attribute__((section("sfrs"), address(0xBF884000)));
extern volatile uint32_t        CHECONCLR __attribute__((section("sfrs"),address(0xBF884004)));
extern volatile uint32_t        CHECONSET __attribute__((section("sfrs"),address(0xBF884008)));
extern volatile uint32_t        CHECONINV __attribute__((section("sfrs"),address(0xBF88400C)));
#define CHEACC CHEACC
extern volatile uint32_t   CHEACC __attribute__((section("sfrs"), address(0xBF884010)));
typedef struct {
  uint32_t CHEIDX:4;
  uint32_t :27;
  uint32_t CHEWEN:1;
} __CHEACCbits_t;
